---
kind: property
id: P:Autodesk.Revit.DB.PrintManager.PaperSizes
source: html/af5bd003-9399-2d70-4197-bc440aefab30.htm
---
# Autodesk.Revit.DB.PrintManager.PaperSizes Property

Get all print sizes of current printer.

## Syntax (C#)
```csharp
public PaperSizeSet PaperSizes { get; }
```

## Remarks
These are the valid paper sizes for the current printer.